Revit 2027 API
BuiltInFailures.DesignOptionFailures.ElementsWillBeDeletedNoOption Property
 Elements will be deleted
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementsWillBeDeletedNoOption { get; }
Public Shared ReadOnly Property ElementsWillBeDeletedNoOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementsWillBeDeletedNoOption {
	FailureDefinitionId^ get ();
}
static member ElementsWillBeDeletedNoOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace